Repository: TopScrech/Sim-Plus
Catalog: Sim-Plus/Localizable.xcstrings
Source language: en
Languages: ar

source: (Requires Reboot)
ar: (يتطلب إعادة تشغيل)

source: **Tip:** You can drag any of the colors from here directly into an Xcode asset catalog ✨
ar: **نصيحة:** يمكنك سحب أي من الألوان من هنا مباشرة إلى Xcode ✨

source: About Control Room
ar: عن كنترول روم

source: Accessibility overrides
ar: تجاوزات إمكانية الوصول

source: Activate
ar: تفعيل

source: Add
ar: أضف

source: Add device chrome to screenshots
ar: أظهر حدود الجهاز في لقطات الشاشة

source: Add New
ar: إضافة جديدة

source: Add new deep link
ar: أضف رابطًا عميقًا جديدًا

source: Alert
ar: تنبيه

source: App
ar: التطبيق

source: App Data
ar: بيانات التطبيق

source: Appearance:
ar: المظهر:

source: Application:
ar: التطبيق:

source: Aps
ar: إشعارات أبل

source: Are you sure you want to delete all unavailable simulators?
ar: هل أنت متأكد أنك تريد حذف كل المحاكيات الغير متوفرة؟

source: Are you sure you want to delete the selected simulators? You will not be able to undo this action.
ar: هل أنت متأكد من أنك تريد حذف أجهزة المحاكاة المحددة؟ لن تتمكن من التراجع عن هذا الإجراء.

source: Are you sure you want to delete this simulator? You will not be able to undo this action.
ar: هل أنت متأكد من أنك تريد حذف جهاز المحاكاة هذا؟ لن تتمكن من التراجع عن هذا الإجراء.

source: Are you sure you want to delete this snapshot? You will not be able to undo this action.
ar: هل أنت متأكد من أنك تريد حذف هذه اللقطة؟ لن تتمكن من التراجع عن هذا الإجراء.

source: Are you sure you want to discard the changes?
ar: هل انت متأكد أنك تريد تجاهل التغييرات؟

source: Are you sure you want to permanently delete %@
ar: هل أنت متأكد انك تريد حذف %@ نهائيًا ؟

source: Are you sure you want to restore this snapshot? You will not be able to undo this action.
ar: هل أنت متأكد من أنك تريد استعادة هذه اللقطة؟ لن تتمكن من التراجع عن هذا الإجراء.

source: Battery state:
ar: حالة البطارية:

source: Bold Text
ar: خط عريض

source: Boot
ar: تشغيل

source: Build %@
ar: بناء %@

source: Built thanks to the contributions of:
ar: تم بناؤه بمساعدة كلٍ من :

source: Button Shapes
ar: أشكال الأزرار

source: Cancel
ar: إلغاء

source: Cellular bars:
ar: أشرطة الخلوي:

source: Cellular mode:
ar: الوضع الخلوي:

source: Choose the device type and operating system for the new simulator
ar: اختر نوع الجهاز ونظام التشغيل لجهاز المحاكاة الجديد

source: Clear overrides
ar: مسح التجاوزات

source: Clear Restoration State
ar: مسح حالة استعادة

source: Clone
ar: استنساخ

source: Clone Simulator
ar: استنساخ المحاكي

source: Clone...
ar: استنساخ...

source: Color
ar: لون

source: Colors
ar: الألوان

source: Confirm
ar: تأكيد

source: Content size:
ar: حجم المحتوى:

source: Control Room
ar: كنترول روم

source: Coordinates: %@
ar: إحداثيات: %@

source: Copy
ar: نسخ

source: Copy pasteboard:
ar: نسخ لوحة اللصق:

source: Create
ar: إنشاء

source: Create named deep links or other URLs to make them easier to open repeatedly inside Control Room. **Tip:** Adjusting the sort order adjusts the order here, in the System tab, and in the menu bar list.
ar: قم بإنشاء روابط عميقة مسماة أو عناوين URL أخرى لتسهيل فتحها بشكل متكرر داخل غرفة التحكم. **نصيحة:** يقوم ضبط ترتيب الفرز بضبط الترتيب هنا، وفي علامة التبويب النظام، وفي قائمة شريط القوائم.

source: Create Simulator
ar: إنشاء محاكي

source: Create Snapshot
ar: إنشاء لقطة

source: Create snapshot...
ar: إنشاء لقطة…

source: Current battery percentage: %@%%
ar: النسبة الحالية للبطارية %@%%

source: Current battery percentage: %lld%%
ar: النسبة الحالية للبطارية %lld%%

source: Customize…
ar: تخصيص...

source: Data:
ar: البيانات:

source: Decimal Places: %lld
ar: الأماكن العشرية: %lld

source: Delete
ar: حذف

source: Delete Simulator
ar: حذف المحاكي

source: Delete Simulators?
ar: حذف كل أجهزة المحاكاة؟

source: Delete Snapshot
ar: حذف اللقطة

source: Delete the app
ar: حذف التطبيق

source: Delete...
ar: حذف…

source: Device
ar: جهاز

source: Device ID:
ar: معرف الجهاز:

source: Device:
ar: الجهاز:

source: Differentiate Without Color
ar: التفريق بدون لون

source: Disable Logging
ar: تعطيل التسجيل

source: Discard
ar: تجاهل

source: Discard changes
ar: تجاهل التغييرات

source: Display:
ar: الشاشة:

source: Done
ar: تم

source: Drag file(s) here to copy them to each simulator's Files directory. (booted simulators only)
ar: اسحب الملف (الملفات) هنا لنسخها إلى دليل ملفات كل جهاز محاكاة. (المحاكاة التي تم تشغيلها فقط)

source: Drag files here to copy
ar: اسحب الملفات هنا لنسخها

source: Drop to copy
ar: اسحب للنسخ

source: Duplicate
ar: نسخ

source: Edit
ar: تحرير

source: Edit Deep Link
ar: تحرير الرابط العميق

source: Edit UserDefaults
ar: تحرير الـ UserDefaults

source: Enable Logging
ar: تفعيل التسجيل

source: Enter a name for the new simulator. It may be the same as the name of an existing simulator, but a unique name will make it easier to identify.
ar: أدخل اسما لجهاز المحاكاة الجديد. قد يكون هو نفس اسم جهاز محاكاة موجود، ولكن الاسم الفريد سيجعل من السهل التعرف عليه.

source: Enter a new name for this simulator. It may be the same as the name of an existing simulator, but a unique name will make it easier to identify.
ar: أدخل اسما جديدا لهذا المحاكي. قد يكون هو نفس اسم جهاز محاكاة موجود، ولكن الاسم الفريد سيجعل من السهل التعرف عليه.

source: Enter a new name for this snapshot. It must be unique.
ar: أدخل اسما جديدا لهذه اللقطة. يجب أن يكون فريدا.

source: Enter the full path to a trusted root certificate
ar: أدخل المسار الكامل إلى شهادة جذر موثوقة

source: Enter the URL or deep link you want to open
ar: أدخل الرابط أو الرابط العميق الذي تريد فتحه

source: Erase
ar: مسح

source: Fetching simulator list…
ar: جار الحصول على قائمة المحاكيات

source: Files path:
ar: مسار الملفات:

source: Get Logs
ar: احصل على السجلات

source: Grant
ar: السماح

source: Hex
ar: رمز سداسي

source: Hex String
ar: النص السداسي

source: Increase Contrast
ar: زيادة التباين

source: Jitter location
ar: موقع الارتعاش

source: Keep window on top
ar: أبق النافذة في الأعلى

source: Language:
ar: اللغة:

source: Launch
ar: تشغيل

source: Level:
ar: المستوى:

source: Locale:
ar: اللغة:

source: Localized
ar: مترجم

source: Localized key
ar: مفتاح مترجم

source: Location
ar: الموقع

source: Locations
ar: المواقع

source: Mac → Simulator
ar: ماك ← محاكي

source: Make sure you include a schema, e.g. https:// or yourapp://
ar: تأكد من تضمين مخطط، على سبيل المثال https:// أو yourapp://

source: Mask:
ar: الحدود:

source: Move the map, paste in coordinates or search for a location, then click Activate to update the simulator to match your centered coordinate.
ar: حرك الخريطة, ألصق إحداثيات أو ابحث عن موقع, ثم اضغط تفعيل لتحديث المحاكي ليوافق إحداثياتك

source: Name
ar: الاسم

source: Network type:
ar: نوع الشبكة:

source: No saved deep links created yet.
ar: لا يوجد أي روابط عميقة محفوظة حتى الآن

source: No simulators
ar: لا يوجد أي محاكي

source: No snapshots yet
ar: لا توجد لقطات حتى الآن

source: No suggestions found
ar: لم بتم العثور على أي إقتراحات

source: On/Off Labels
ar: عنوانين التشغيل و الإيقاف

source: Open
ar: فتح

source: Open app bundle
ar: افتح حزمة التطبيق

source: Open data folder
ar: افتح مجلد البيانات

source: Open Editor
ar: فتح المحرر

source: Open first app group folder
ar: افتح مجلد مجموعة التطبيق الأول

source: Open in Finder
ar: فتح في Finder

source: Open in Terminal
ar: فتح في Terminal

source: Open URL:
ar: فتح الرابط:

source: Operator
ar: المشغل

source: Overrides
ar: التعدي

source: Path to Terminal
ar: المسار في Terminal

source: Permissions:
ar: الأذونات:

source: Power
ar: الطاقة

source: Prefer Cross-Fade Transitions
ar: تفضل التحولات المتقاطعة

source: Previous Colors
ar: اللون السابق

source: Record %@
ar: تسجيل %@

source: Reduce Motion
ar: تقليل الحركة

source: Reduce Transparency
ar: تقليل الشفافية

source: Regular
ar: عادي

source: Removes any saved state restoration data, such as @SceneStorage properties used by the app.
ar: يزيل أي بيانات استعادة حالة محفوظة، مثل خصائص @SceneStorage التي يستخدمها التطبيق.

source: Rename
ar: إعادة تسمية

source: Rename Simulator
ar: إعادة تسمية المحاكي

source: Rename Snapshot
ar: إعادة تسمية اللقطة

source: Rename...
ar: إعادة تسمية…

source: Reopen last URL
ar: فتح آخر رابط

source: Resend last push notification
ar: إعادة إرسال آخر إشعار

source: Reset
ar: إعادة ضبط

source: Reset Keychain
ar: إعادة تعيين سلسلة المفاتيح

source: Restart
ar: إعادة التشغيل

source: Restart last selected app
ar: إعادة فتح آخر تطبيق تم اختياره

source: Restore
ar: إستعادة

source: Restore Snapshot
ar: استعادة اللقطة

source: Revoke
ar: إلغاء الصلاحية

source: Root certificate:
ar: الشهادة الجذرية:

source: Root path:
ar: المسار الجذري:

source: Save
ar: حفظ

source: Save %@
ar: حفظ %@

source: Save as %@
ar: حفظ كـ %@

source: Save as BMP
ar: حفظ كـ BMP

source: Save as JPEG
ar: حفظ كـ JPEG

source: Save as PNG
ar: حفظ كـ PNG

source: Save as TIFF
ar: حفظ كـ TIFF

source: Save location
ar: حفظ الموقع

source: Save to: %@
ar: حفظ في: %@

source: Saved deep links
ar: حفظ الراوبط العميقة

source: Saved Deep Links
ar: الروابط العميقة المحفوظة

source: Saved Links
ar: الروابط العميقة المحفوظة

source: Saved locations
ar: المواقع المحفوظة

source: Screenshot Format:
ar: صيغة لفطات الشاشة

source: Screenshots
ar: لقطات الشاشة

source: Select a simulator from the list.
ar: اختر أي محاكي من القائمة.

source: Select Color
ar: اختر لون

source: Select Templates
ar: اختر القوالب

source: Send Push
ar: أرسل الإشعار

source: Set
ar: تعيين

source: Set Language/Locale
ar: تعيين اللغة

source: Set the maximum number of decimal places to use when generating code for picked simulator colors. The default is 2.
ar: حدد الحد الأقصى لعدد المنازل العشرية لاستخدامها عند إنشاء رمز لألوان المحاكاة المختارة. الافتراضي هو 2.

source: Set to 9:41
ar: تعيين على 9:41

source: Shortcuts
ar: الإختصارات

source: Show %@ devices
ar: أظهر %@ الأجهزة

source: Show booted devices first
ar: أظهر الأجهزة المفعلة أولًا

source: Show Default simulator
ar: أظهر المحاكي الغفتراضي

source: Show icon in menu bar
ar: إظهار الرمز في شريط القوائم

source: Show system apps
ar: أظهر تطبيقات النظام

source: Shutdown
ar: إغلاق

source: Simulator → Mac
ar: محاكي ← ماك

source: Smart Invert
ar: العكس الذكي

source: Snapshots
ar: اللقطات

source: Snapshots:
ar: اللقطات:

source: Sound
ar: الصوت

source: Status Bar
ar: شريط الحالة

source: Stop Recording
ar: إيقاف التسجيل

source: SwiftUI Code
ar: كود SwiftUI

source: SwiftUI code:
ar: كود SwiftUI:

source: System
ar: النظام

source: Terminate
ar: إغلاق بالكامل

source: This is an experimental feature and may not function properly yet.
ar: هذه ميزة تجريبية وقد لا تعمل بشكل صحيح حتى الآن.

source: Time:
ar: الوقت:

source: Trigger iCloud Sync
ar: تشغيل مزامنة iCloud

source: UIKit Code
ar: كود UIKit

source: UIKit code:
ar: كود UIKit:

source: Uninstall
ar: إلغاء التثبيت

source: Unknown Alert
ar: تنبيه غير معروف

source: Uppercase Hex Strings
ar: تكبير الأحرف للرموز السداسية

source: URL
ar: رابط

source: User info
ar: معلومات المستخدم

source: Version %@
ar: نسخة %@

# Version %@ (%@)
source: Version %1$@ (%2$@)
ar: نسخة %1$@ (%2$@)

source: Video Format:
ar: صيغة الفيديو

source: Wi-Fi bars:
ar: أشرطة واي فاي:

source: Wi-Fi mode:
ar: نوع الوايفاي:

source: Window
ar: نافذة

source: You can’t undo this action.
ar: لا يمكنك التراجع عن هذا الإجراء
